<a href="https://colab.research.google.com/github/YuDeokRin/ICT_innovation_square/blob/main/02.pandas/2020%EB%85%84_9%EC%9B%94_17%EC%9D%BC_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
exam_data={
    "이름":["서준","우현","인아"],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}

In [ ]:
df=pd.DataFrame(exam_data)

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
#이름칸에 저장된 이름으로 인덱스 하고싶다
#df.set_dinx([칸이름])
ndf =df.set_index(["이름"])  #이름이 index인 새로운 dataFrame 새로 만들어서 리턴

In [ ]:
df    #헌거

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
ndf.set_index(["음악"])

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [ ]:
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#ndf.set_index(["음악"]) : 음악 칸을 인덱스로 설정하면서 기존 인덱스에 덮어 써진다
#"이름" 인덱스 사라짐
ndf2 = ndf.set_index(["음악"])

In [ ]:
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

 * 이름이 인덱스 였는데 인덱스를 음악으로 바꾸면 -> 인덱스 덮어쓰기 (이름 삭제)
  * 이름 인덱스 였는데 "음악"으로 인덱스 바꾸기
    1. 이름 인덱스를 인덱스 해제  reset_index()
    2. 음악으로 인덱스 수정 set_index()

In [ ]:
ndf # 이름이 인덱스

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#인덱스 해제 : 이름칸이 보통 칸으로 변함
ndf=ndf.reset_index()

In [ ]:
ndf

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
ndf = ndf.set_index(["음악"])

In [ ]:
ndf

     이름  수학  영어   체육
음악
85   서준  90  98  100
95   우현  80  89   90
100  인아  70  95   90

In [ ]:
#음악칸 인덱스 해제
ndf=ndf.reset_index()

In [ ]:
ndf

    음악  이름  수학  영어   체육
0   85  서준  90  98  100
1   95  우현  80  89   90
2  100  인아  70  95   90

In [ ]:
ndf=ndf.reset_index()

In [ ]:
ndf

   index   음악  이름  수학  영어   체육
0      0   85  서준  90  98  100
1      1   95  우현  80  89   90
2      2  100  인아  70  95   90

In [ ]:
ndf.drop("index", axis=1, inplace=True)

In [ ]:
ndf

    음악  이름  수학  영어   체육
0   85  서준  90  98  100
1   95  우현  80  89   90
2  100  인아  70  95   90

이름과 수학 두개를 동시에 인덱스로 만듬

In [ ]:
#set_index(["컴럼1","컬럼2"])
ndf=ndf.set_index(["이름","수학"])

In [ ]:
ndf

        음악  영어   체육
이름 수학
서준 90   85  98  100
우현 80   95  89   90
인아 70  100  95   90

이름이 첫번째 인덱스이므로 첫번째 인덱스는 loc 검색

In [ ]:
#우현 검색
ndf.loc["우현"]

    음악  영어  체육
수학
80  95  89  90

In [ ]:
#수학점수 80점 검색
#첫번째 인덱스 이외의 인덱스는 loc으로 검색 안됨
#ndf.loc[80]

In [ ]:
ndf

        음악  영어   체육
이름 수학
서준 90   85  98  100
우현 80   95  89   90
인아 70  100  95   90

* 첫번째 인덱스 이름은 loc으로 검색
* 첫번째 인덱스 포함 모든 인덱스는 xs(인덱스값, level=몆번째 인덱스 0:첫번째 1:두번째)

In [ ]:
#수학 인덱스 (두번째 인덱스) 80 검색
ndf.xs(80, level=1)

    음악  영어  체육
이름
우현  95  89  90

In [ ]:
#이름 인덱스 (첫번째 인덱스) 서준 검색
ndf.xs("서준", level=0)

    음악  영어   체육
수학
90  85  98  100

In [ ]:
ndf

        음악  영어   체육
이름 수학
서준 90   85  98  100
우현 80   95  89   90
인아 70  100  95   90

In [ ]:
ndf.xs( ("인아",70))

음악    100
영어     95
체육     90
Name: (인아, 70), dtype: int64

In [ ]:
#pd.DataFrame( Series ) : DataFrame으로 변환
pd.DataFrame(  ndf.xs( ("인아",70))  )

     인아
     70
음악  100
영어   95
체육   90

In [ ]:
#줄 칸 방향 변경
pd.DataFrame(  ndf.xs( ("인아",70))  ).T

        음악  영어  체육
인아 70  100  95  90

In [ ]:
ndf

        음악  영어   체육
이름 수학
서준 90   85  98  100
우현 80   95  89   90
인아 70  100  95   90

In [ ]:
ndf.values

array([[ 85,  98, 100],
       [ 95,  89,  90],
       [100,  95,  90]])

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df.reindex(["학1","학2","학3"])

     이름  수학  영어  음악  체육
학1  NaN NaN NaN NaN NaN
학2  NaN NaN NaN NaN NaN
학3  NaN NaN NaN NaN NaN

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df=df.rename(index={0:"학1",1:"학2",2:"학3"})

In [ ]:
df

    이름  수학  영어   음악   체육
학1  서준  90  98   85  100
학2  우현  80  89   95   90
학3  인아  70  95  100   90

reindex([새로운 인덱스])
 : 줄 순서 바꾸거나, 새로운 줄 추가, 기존 줄 삭제

In [ ]:
df = df.reindex(["학3","학1","학2"])

In [ ]:
df

    이름  수학  영어   음악   체육
학3  인아  70  95  100   90
학1  서준  90  98   85  100
학2  우현  80  89   95   90

In [ ]:
df =df.reindex(["학3","학2"])

In [ ]:
df

    이름  수학  영어   음악  체육
학3  인아  70  95  100  90
학2  우현  80  89   95  90

In [ ]:
df = df.reindex(["학3","학2","아이유","BTS"])

 * NaN : 이 셀에 아직 데이터가 입력이 안되었음
 * 0 : 0이라고 입력 된것

In [ ]:
df

      이름    수학    영어     음악    체육
학3    인아  70.0  95.0  100.0  90.0
학2    우현  80.0  89.0   95.0  90.0
아이유  NaN   NaN   NaN    NaN   NaN
BTS  NaN   NaN   NaN    NaN   NaN

In [ ]:
df.loc["아이유","체육"]=0

 * 아이유 체육점수는 0 : 아이유가 체육 0점 맞음
 * BTS 체육점수는 NaN : BTS의 체육점수는 입력이 안됨
 * 아이유 체육점수는 0점
 * BTS 체육점수는 입력전(미정)

In [ ]:
df

      이름    수학    영어     음악    체육
학3    인아  70.0  95.0  100.0  90.0
학2    우현  80.0  89.0   95.0  90.0
아이유  NaN   NaN   NaN    NaN   0.0
BTS  NaN   NaN   NaN    NaN   NaN

In [ ]:
#오름 차순 정렬
df = df.sort_index()

In [ ]:
df

      이름    수학    영어     음악    체육
BTS  NaN   NaN   NaN    NaN   NaN
아이유  NaN   NaN   NaN    NaN   0.0
학2    우현  80.0  89.0   95.0  90.0
학3    인아  70.0  95.0  100.0  90.0

In [ ]:
#내림 차순 정렬
df = df.sort_index(ascending=False)

In [ ]:
df

      이름    수학    영어     음악    체육
학3    인아  70.0  95.0  100.0  90.0
학2    우현  80.0  89.0   95.0  90.0
아이유  NaN   NaN   NaN    NaN   0.0
BTS  NaN   NaN   NaN    NaN   NaN

 * 컬럼에 저장된 값으로 정렬 sort_values()
 * sort_values(by=["칸이름"])

In [ ]:
df.sort_values(by=["체육"])

      이름    수학    영어     음악    체육
아이유  NaN   NaN   NaN    NaN   0.0
학3    인아  70.0  95.0  100.0  90.0
학2    우현  80.0  89.0   95.0  90.0
BTS  NaN   NaN   NaN    NaN   NaN

In [ ]:
#체육칸 기준으로 정렬(큰거 -> 작은거 : 내림차순)
#NaN은 오름 차순(내림차순)일 때 맨 마지막
df.sort_values(by=["체육"],ascending=False)  # 내림차순

      이름    수학    영어     음악    체육
학3    인아  70.0  95.0  100.0  90.0
학2    우현  80.0  89.0   95.0  90.0
아이유  NaN   NaN   NaN    NaN   0.0
BTS  NaN   NaN   NaN    NaN   NaN

In [ ]:
df.sort_values(by=["체육","수학"],ascending=False)

      이름    수학    영어     음악    체육
학2    우현  80.0  89.0   95.0  90.0
학3    인아  70.0  95.0  100.0  90.0
아이유  NaN   NaN   NaN    NaN   0.0
BTS  NaN   NaN   NaN    NaN   NaN